namespace C
{
    internal class Program
    {
        static void Main(string[] args)
        {
            string data = @"Китай\t1405023000\t24.08.2020\t17.99%\n
            Индия\t1375100000\t24.08.2020\t17.6%\n
            США\t329957441\t15.07.2020\t4.24%\n
            Индонезия\t266911900\t01.07.2019\t3.42%\n
            Пакистан\t218647040\t24.08.2020\t2.8%\n
            Бразилия\t211950300\t24.08.2020\t2.71%\n
            Нигерия\t208426036\t24.08.2020\t2.67%\n
            Бангладеш\t171147762\t24.08.2020\t2.19%\n
            Россия\t146748590\t01.01.2020\t1.88%\n
            Мексика\t127792286\t01.07.2020\t1.64%\n
            Япония\t125950000\t01.03.2020\t1.61%\n
            Эфиопия\t112079000\t01.07.2019\t1.43%\n
            Филиппины\t108968790\t24.08.2020\t1.39%\n
            Египет\t100812120\t24.08.2020\t1.29%\n
            Вьетнам\t96208984\t01.04.2019\t1.23%\n
            ДРК\t86791000\t01.07.2019\t1.11%\n
            Иран\t84393386\t24.08.2020\t1.08%\n
            Турция\t83154997\t1.01.2020\t1.06%\n
            Германия\t83149300\t1.10.2019\t1.06%\n
            Франция\t68859599\t01.01.2018\t0.88%
            ";
            Console.WriteLine(data)
        }
    }
}
